In [1]:
!pip install pandas
!pip install mysql-connector

Requirement already satisfied: pandas in /opt/conda/lib/python3.7/site-packages (1.2.3)
Requirement already satisfied: pytz>=2017.3 in /opt/conda/lib/python3.7/site-packages (from pandas) (2021.1)
Requirement already satisfied: python-dateutil>=2.7.3 in /opt/conda/lib/python3.7/site-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.16.5 in /opt/conda/lib/python3.7/site-packages (from pandas) (1.20.1)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.7/site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
Requirement already satisfied: mysql-connector in /opt/conda/lib/python3.7/site-packages (2.2.9)

Copyright Jana Schaich Borg/Attribution-NonCommercial 4.0 International (CC BY-NC 4.0)

# MySQL Exercise 2: Using WHERE to select specific data

When you are querying a business-related data set, you are usually doing so to answer a question about a subset of the data.  In this lesson you will learn how to select subsets of rows of data that meet criteria you specify, to help you prepare for these types of business questions.  The mechanism within a SQL query that allows you specify which subset of data you want to retrieve is the WHERE clause.

Before we begin, let's load the SQL library and Dognition database, and make the Dognition database our default database.  As a reminder, these are the lines of code you should input:

```python
%load_ext sql
%sql mysql://studentuser:studentpw@localhost/dognitiondb
%sql USE dognitiondb
```

In [2]:
import pandas as pd
import mysql.connector
pd.set_option('display.max_columns',None)

In [3]:
mydb = mysql.connector.connect(
  host="localhost",
  user="studentuser",
  passwd="studentpw",
  database="dognitiondb"
)

In [4]:
print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x7f7f831b0290>

In [5]:
mycursor = mydb.cursor()

Recall the general syntax structure we learned from the "Introduction to Query Syntax" video at the beginning of the week:

<img src="https://duke.box.com/shared/static/vnnubyrx8r46me7fmw1ayhcd8wn16wf8.jpg" width=400 alt="SELECT FROM WHERE" />

This guide indicates that whenever the data we select need to meet certain criteria (specified using a "WHERE" clause), we specify those criteria after we have specified where the data come from.   

Let's say we want to know which Dognition customers received access to Dognition's first four tests for free.  These customers have a 1 in the "free_start_user" column of the users table.  The syntax you would use to select the data for these customers would be:

```mySQL
SELECT user_guid
FROM users
WHERE free_start_user=1;
```
(Note: user_guid is the field that specifies the unique User ID number of each customer in the users table)

If you wanted to double-check that the outputted data indeed met the criteria you specified, you could include a second column in your output that would give you the value in the free_start_user field for each row of the output: 

```mySQL
SELECT user_guid, free_start_user
FROM users
WHERE free_start_user=1;
```

Try this on your own below.  Remember to use %%sql to indicate that your query will span multiple lines, and consider whether you would like to limit the number of results you ouput using the syntax we learned last lesson.  If you do use a LIMIT statement, remember that it has to be the last item in your query, so this time you will place it after your WHERE statement instead of after your FROM statement.

In [6]:
pd.read_sql_query("SELECT user_guid, free_start_user \
                   FROM users \
                   WHERE free_start_user=1  \
                   LIMIT 5;", mydb)

                              user_guid  free_start_user
0  ce28a468-7144-11e5-ba71-058fbc01cf0b                1
1  ce28ac4c-7144-11e5-ba71-058fbc01cf0b                1
2  ce28acba-7144-11e5-ba71-058fbc01cf0b                1
3  ce28ad1e-7144-11e5-ba71-058fbc01cf0b                1
4  ce28ad82-7144-11e5-ba71-058fbc01cf0b                1

**Question 1: How would you select the Dog IDs for the dogs in the Dognition data set that were DNA tested (these should have a 1 in the dna_tested field of the dogs table)?  Try it below (if you do not limit your output, your query should output data from 1433 dogs):**

In [7]:
pd.read_sql_query("SELECT dog_guid \
                   FROM dogs \
                   WHERE dna_tested=1  \
                   ;", mydb)

                                  dog_guid
0     fd27b6b4-7144-11e5-ba71-058fbc01cf0b
1     fd27cd98-7144-11e5-ba71-058fbc01cf0b
2     fd27ce1a-7144-11e5-ba71-058fbc01cf0b
3     fd27d144-7144-11e5-ba71-058fbc01cf0b
4     fd27d1c6-7144-11e5-ba71-058fbc01cf0b
...                                    ...
1428  fd64f7fe-7144-11e5-ba71-058fbc01cf0b
1429  fd650bc2-7144-11e5-ba71-058fbc01cf0b
1430  fd651a5e-7144-11e5-ba71-058fbc01cf0b
1431  fd651f68-7144-11e5-ba71-058fbc01cf0b
1432  fd655280-7144-11e5-ba71-058fbc01cf0b

[1433 rows x 1 columns]

The SELECT statement can be used to interact with all data types, and there are many operators and functions that allow you to interact with the data in different ways.  Here are some resources that describe these operators and functions:

https://dev.mysql.com/doc/refman/5.7/en/sql-function-reference.html
http://www.w3resource.com/mysql/mysql-functions-and-operators.php 


Some of the most common operators include: =,<,>,<=, and >=.  If you want to select something that is NOT a specific value, use != or <>.  You can also use logical operators, such as AND and OR.

Let's start by examining how operators can be used with numerical data.

If you wanted to examine the Dog IDs of dogs who weighed between 10 and 50 pounds, you could query:

```mySQL
SELECT dog_guid, weight
FROM dogs
WHERE weight BETWEEN 10 AND 50;
```

The above query provided an example of how to use the BETWEEN operator (described in the links provided above), as well as an example of how AND can be used to specify multiple criteria.  If you wanted to examine the Dog IDs of dogs who were "fixed" (neutered) OR DNA tested, you could use OR in the following query:

```mySQL
SELECT dog_guid, dog_fixed, dna_tested
FROM dogs
WHERE dog_fixed=1 OR dna_tested=1;
```

If you wanted to examine the Dog IDs of dogs who were fixed but NOT DNA tested, you could query:
```mySQL
SELECT dog_guid, dog_fixed, dna_tested
FROM dogs
WHERE dog_fixed=1 AND dna_tested!=1;
```

**Question 2: How would you query the User IDs of customers who bought annual subscriptions, indicated by a "2" in the membership_type field of the users table?  (If you do not limit the output of this query, your output should contain 4919 rows.)**

In [8]:
pd.read_sql_query("SELECT * from users \
                  LIMIT 5;", mydb)

,sign_in_count,created_at,updated_at,max_dogs,membership_id,subscribed,exclude,free_start_user,last_active_at,membership_type,user_guid,city,state,zip,country,utc_correction
0,14,2013-02-05 03:52:02,2015-03-12 00:25:15,2,2,1,NaN,NaN,2015-03-12 00:25:15,2,ce134e42-7144-11e5-ba71-058fbc01cf0b,Grand Forks,ND,58201,US,-6
1,8,2013-02-05 15:29:50,2015-01-28 20:51:49,2,1,1,NaN,NaN,NaT,1,ce1353d8-7144-11e5-ba71-058fbc01cf0b,Barre,MA,1005,US,-5
2,3,2013-02-05 17:21:18,2015-01-28 20:51:49,1,1,1,NaN,NaN,NaT,1,ce135ab8-7144-11e5-ba71-058fbc01cf0b,Darien,CT,6820,US,-5
3,21,2013-02-05 13:50:48,2015-01-28 20:51:49,1,1,1,NaN,NaN,2014-09-12 19:26:29,1,ce13507c-7144-11e5-ba71-058fbc01cf0b,Winnetka,IL,60093,US,-6
4,181,2013-02-05 17:54:42,2015-01-28 20:51:49,13,2,1,1.0,0.0,NaT,2,ce135e14-7144-11e5-ba71-058fbc01cf0b,Raleigh,NC,27606,US,-5

In [9]:
users_table = pd.read_sql_query("SELECT * from users \
                  ;", mydb)

In [10]:
pd.read_sql_query("SELECT COUNT(*) from users", mydb)

   COUNT(*)
0     34917

In [11]:
#users_table.to_csv("users.csv",index=False)

In [12]:
pd.read_sql_query("SELECT user_guid \
                   FROM users \
                   WHERE membership_type = 2  \
                   ;", mydb)

                                 user_guid
0     ce134e42-7144-11e5-ba71-058fbc01cf0b
1     ce135e14-7144-11e5-ba71-058fbc01cf0b
2     ce135e14-7144-11e5-ba71-058fbc01cf0b
3     ce136ac6-7144-11e5-ba71-058fbc01cf0b
4     ce136c24-7144-11e5-ba71-058fbc01cf0b
...                                    ...
4914  ce9af4d2-7144-11e5-ba71-058fbc01cf0b
4915  ce9af824-7144-11e5-ba71-058fbc01cf0b
4916  ce9b0314-7144-11e5-ba71-058fbc01cf0b
4917  ce9b23e4-7144-11e5-ba71-058fbc01cf0b
4918  ce9b3168-7144-11e5-ba71-058fbc01cf0b

[4919 rows x 1 columns]

Now let's try using the WHERE statement to interact with text data (called "strings").

Strings need to be surrounded by quotation marks in SQL.  MySQL accepts both double and single quotation marks, but some database systems only accept single quotation marks.  Whenever a string contains an SQL keyword, the string must be enclosed in backticks instead of quotation marks.

>` 'the marks that surrounds this phrase are single quotation marks' `     
>` "the marks that surrounds this phrase are double quotation marks" `     
>`` `the marks that surround this phrase are backticks` ``

Strings enclosed in quotation or backticks can be used with many of the same operators as numerical data.  For example, imagine that you only wanted to look at data from dogs of the breed "Golden Retrievers."  You could query (note that double quotation marks could have been used in this example is well):

```mySQL
SELECT dog_guid, breed
FROM dogs
WHERE breed='golden retriever';
```

The IN operator allows you to specify multiple values in a WHERE clause.  Each of these values must be separated by a comma from the other values, and the entire list of values should be enclosed in parentheses.  If you wanted to look at all the data from Golden Retrievers and Poodles, you could certainly use the OR operator, but the IN operator would be even more efficient (note that single quotation marks could have been used in this example, too):

```mySQL
SELECT dog_guid, breed
FROM dogs
WHERE breed IN ("golden retriever","poodle");
```

The LIKE operator allows you to specify a pattern that the textual data you query has to match.  For example, if you wanted to look at all the data from breeds whose names started with "s", you could query:

```mySQL
SELECT dog_guid, breed
FROM dogs
WHERE breed LIKE ("s%");
```

In this syntax, the percent sign indicates a wild card.  Wild cards represent unlimited numbers of missing letters.  This is how the placement of the percent sign would affect the results of the query:

+ WHERE breed LIKE ("s%") = the breed must start with "s", but can have any number of letters after the "s"
+ WHERE breed LIKE ("%s") = the breed must end with "s", but can have any number of letters before the "s"
+ WHERE breed LIKE ("%s%") = the breed must contain an "s" somewhere in its name, but can have any number of letters before or after the "s"

**Question 3: How would you query all the data from customers located in the state of North Carolina (abbreviated "NC") or New York (abbreviated "NY")?  If you do not limit the output of this query, your output should contain 1333 rows. **

In [13]:
pd.read_sql_query("SELECT user_guid \
                   FROM users \
                   WHERE state IN ('NC','NY');", mydb)

                                 user_guid
0     ce135e14-7144-11e5-ba71-058fbc01cf0b
1     ce135e14-7144-11e5-ba71-058fbc01cf0b
2     ce134be0-7144-11e5-ba71-058fbc01cf0b
3     ce1371a6-7144-11e5-ba71-058fbc01cf0b
4     ce137c78-7144-11e5-ba71-058fbc01cf0b
...                                    ...
1328  ce9a07a2-7144-11e5-ba71-058fbc01cf0b
1329  ce9ac23c-7144-11e5-ba71-058fbc01cf0b
1330  ce9af40a-7144-11e5-ba71-058fbc01cf0b
1331  ce9aed52-7144-11e5-ba71-058fbc01cf0b
1332  ce9b306e-7144-11e5-ba71-058fbc01cf0b

[1333 rows x 1 columns]

Next, let's try using the WHERE statement to interact with datetime data.  Time-related data is a little more complicated to work with than other types of data, because it must have a very specific format.  MySQL comes with the following data types for storing a date or a date/time value in the database:

DATE - format YYYY-MM-DD  
DATETIME - format: YYYY-MM-DD HH:MI:SS  
TIMESTAMP - format: YYYY-MM-DD HH:MI:SS  
YEAR - format YYYY or YY

One of the interesting things about time-related data is that SQL has commands to break the data into different "time parts" or "date parts" as described here:

http://www.tutorialspoint.com/mysql/mysql-date-time-functions.htm


A time stamp stored in one row of data might look like this: 

```
2013-02-07 02:50:52
```
The year part of that entry would be 2013, the month part would be "02" or "February" (depending on the requested format), the seconds part would be "52", and so on.  SQL functions easily allow you to convert those parts into formats you might need for specific analyses.  For example, imagine you wanted to know how many tests Dognition customers complete on different days of the week.  To complete this analysis, you would need to convert the time stamps of each completed test to a variable that outputted the correct day of the week for that date.  DAYNAME is a function that will do this for you.  You can combine DAYNAME with WHERE to select data from only a single day of the week:

```mySQL
SELECT dog_guid, created_at
FROM complete_tests
WHERE DAYNAME(created_at)="Tuesday"
```

You can also use common operators like =,<,>,<=,>=,!=, or <> with dates just like you would with other types of data, but whether you refer to the date as a number or text will depend on whether you are selecting individual date parts or treating the date/time entry as a single clause.   For example, you could select all the Dog IDs and time stamps of tests completed after the 15 of every month with this command that extracts the "DAY" date part out of each time stamp:

```mySQL
SELECT dog_guid, created_at
FROM complete_tests
WHERE DAY(created_at) > 15
```

You could also select all the Dog IDs and time stamps of completed tests from after February 4, 2014 by treating date entries as text clauses with the following query:

```mySQL
SELECT dog_guid, created_at
FROM complete_tests
WHERE created_at > '2014-02-04'
```

Note that you have to use a different set of functions than you would use for regular numerical data to add or subtract time from any values in these datetime formats.  For example, instead of using a minus sign to find the difference in time between two time stamps or dates, you would use the TIMEDIFF or DATEDIFF function.  See the references provided above for a list of these functions.  

**Question 4: Now that you have seen how datetime data can be used to impose criteria on the data you select, how would you select all the Dog IDs and time stamps of Dognition tests completed before October 15, 2015 (your output should have 193,246 rows)?**

In [14]:
pd.read_sql_query("SELECT * from dogs \
                  LIMIT 5;", mydb)

,gender,birthday,breed,weight,dog_fixed,dna_tested,created_at,updated_at,dimension,exclude,breed_type,breed_group,dog_guid,user_guid,total_tests_completed,mean_iti_days,mean_iti_minutes,median_iti_days,median_iti_minutes,time_diff_between_first_and_last_game_days,time_diff_between_first_and_last_game_minutes
0,female,2011,Labrador Retriever,50,1,0,2013-02-05 03:57:19,2013-07-25 19:41:49,charmer,NaN,Pure Breed,Sporting,fd27b272-7144-11e5-ba71-058fbc01cf0b,ce134e42-7144-11e5-ba71-058fbc01cf0b,21,28.20107581,40609.549167,0.004687499952,6.7499999308,564.0215162,812190.98333
1,male,2007,Shetland Sheepdog,20,1,0,2013-02-05 15:35:09,2013-07-25 19:41:49,protodog,NaN,Pure Breed,Herding,fd27b5ba-7144-11e5-ba71-058fbc01cf0b,ce1353d8-7144-11e5-ba71-058fbc01cf0b,20,0.41330713937,595.1622807,0.0058449074865,8.4166667806,7.8528356481,11308.083333
2,male,2012,Golden Retriever,70,0,1,2013-02-05 17:22:56,2013-07-25 19:41:49,None,NaN,Pure Breed,Sporting,fd27b6b4-7144-11e5-ba71-058fbc01cf0b,ce135ab8-7144-11e5-ba71-058fbc01cf0b,2,0.0091319445066,13.15000009,0.0091319445066,13.15000009,0.0091319445066,13.15000009
3,male,2011,Golden Retriever,70,0,0,2013-02-05 17:40:57,2014-05-30 15:52:53,None,NaN,Pure Breed,Sporting,fd27b79a-7144-11e5-ba71-058fbc01cf0b,ce13507c-7144-11e5-ba71-058fbc01cf0b,11,56.115179398,80805.858333,0.0044328703647,6.3833333252,561.15179398,808058.58333
4,female,2010,Shih Tzu,190,0,0,2013-02-05 18:12:28,2014-05-30 15:52:54,einstein,1.0,Pure Breed,Toy,fd27b86c-7144-11e5-ba71-058fbc01cf0b,ce135e14-7144-11e5-ba71-058fbc01cf0b,31,7.7342542438,11137.326111,0.00039930554425,0.57499998372,232.02762731,334119.78333

In [15]:
pd.read_sql_query("SELECT dog_guid, created_at \
                  FROM complete_tests \
                  WHERE created_at < '2015-10-15' \
                  LIMIT 5;", mydb)

                               dog_guid          created_at
0  fd27b86c-7144-11e5-ba71-058fbc01cf0b 2013-02-05 18:26:54
1  fd27b86c-7144-11e5-ba71-058fbc01cf0b 2013-02-05 18:31:03
2  fd27b86c-7144-11e5-ba71-058fbc01cf0b 2013-02-05 18:32:04
3  fd27b86c-7144-11e5-ba71-058fbc01cf0b 2013-02-05 18:32:25
4  fd27b86c-7144-11e5-ba71-058fbc01cf0b 2013-02-05 18:32:56

Last, let's use the WHERE statement in combination with two very important operators: IS NULL and IS NOT NULL.  IS NULL will indicate rows of data that have null values.  IS NOT NULL will indicate rows that do not have null values.  We saw in previous exercises that many of the entries in the free_start_user field of the user table in the Dognition data set had NULL values.  To select only the rows that have non-null data you could query:

```mySQL
SELECT user_guid
FROM users
WHERE free_start_user IS NOT NULL;
```

To select only the rows that have null data so that you can examine if these rows share something else in common, you could query:

```mySQL
SELECT user_guid
FROM users
WHERE free_start_user IS NULL;
```

**Question 5: How would you select all the User IDs of customers who do not have null values in the State field of their demographic information (if you do not limit the output, you should get 17,985 from this query -- there are a lot of null values in the state field!)?**

In [16]:
pd.read_sql_query("SELECT * FROM users \
                  LIMIT 5;", mydb)

,sign_in_count,created_at,updated_at,max_dogs,membership_id,subscribed,exclude,free_start_user,last_active_at,membership_type,user_guid,city,state,zip,country,utc_correction
0,14,2013-02-05 03:52:02,2015-03-12 00:25:15,2,2,1,NaN,NaN,2015-03-12 00:25:15,2,ce134e42-7144-11e5-ba71-058fbc01cf0b,Grand Forks,ND,58201,US,-6
1,8,2013-02-05 15:29:50,2015-01-28 20:51:49,2,1,1,NaN,NaN,NaT,1,ce1353d8-7144-11e5-ba71-058fbc01cf0b,Barre,MA,1005,US,-5
2,3,2013-02-05 17:21:18,2015-01-28 20:51:49,1,1,1,NaN,NaN,NaT,1,ce135ab8-7144-11e5-ba71-058fbc01cf0b,Darien,CT,6820,US,-5
3,21,2013-02-05 13:50:48,2015-01-28 20:51:49,1,1,1,NaN,NaN,2014-09-12 19:26:29,1,ce13507c-7144-11e5-ba71-058fbc01cf0b,Winnetka,IL,60093,US,-6
4,181,2013-02-05 17:54:42,2015-01-28 20:51:49,13,2,1,1.0,0.0,NaT,2,ce135e14-7144-11e5-ba71-058fbc01cf0b,Raleigh,NC,27606,US,-5

In [17]:
pd.read_sql_query("SELECT user_guid \
                   FROM users \
                   WHERE state IS NOT NULL \
                   ;", mydb)

                                  user_guid
0      ce134e42-7144-11e5-ba71-058fbc01cf0b
1      ce1353d8-7144-11e5-ba71-058fbc01cf0b
2      ce135ab8-7144-11e5-ba71-058fbc01cf0b
3      ce13507c-7144-11e5-ba71-058fbc01cf0b
4      ce135e14-7144-11e5-ba71-058fbc01cf0b
...                                     ...
17980  ce9b2aba-7144-11e5-ba71-058fbc01cf0b
17981  ce9b2eb6-7144-11e5-ba71-058fbc01cf0b
17982  ce9b306e-7144-11e5-ba71-058fbc01cf0b
17983  ce9b33b6-7144-11e5-ba71-058fbc01cf0b
17984  ce9b35e6-7144-11e5-ba71-058fbc01cf0b

[17985 rows x 1 columns]

## Practice writing your own SELECT and WHERE statements!

### These queries will combine what you've learned in the past two lessons.

**Question 6: How would you retrieve the Dog ID, subcategory_name, and test_name fields, in that order, of the first 10 reviews entered in the Reviews table to be submitted in 2014?**

In [18]:
pd.read_sql_query("SELECT * FROM reviews \
                  LIMIT 5;", mydb)

,rating,created_at,updated_at,user_guid,dog_guid,subcategory_name,test_name
0,0.0,2014-05-01 19:08:00,2014-05-01 19:08:00,ce3c42ca-7144-11e5-ba71-058fbc01cf0b,ce3ac77e-7144-11e5-ba71-058fbc01cf0b,Empathy,Yawn Warm-up
1,0.0,2014-05-01 22:01:36,2014-05-01 22:01:36,ce2acd7e-7144-11e5-ba71-058fbc01cf0b,ce2aedcc-7144-11e5-ba71-058fbc01cf0b,Empathy,Eye Contact Warm-up
2,2.0,2014-05-01 22:05:37,2014-05-01 22:05:37,ce2acd7e-7144-11e5-ba71-058fbc01cf0b,ce2aedcc-7144-11e5-ba71-058fbc01cf0b,Empathy,Eye Contact Game
3,NaN,2014-05-01 22:19:00,2014-05-01 22:19:00,ce2acd7e-7144-11e5-ba71-058fbc01cf0b,ce2aedcc-7144-11e5-ba71-058fbc01cf0b,Communication,Treat Warm-up
4,1.0,2014-05-01 22:35:30,2014-05-01 22:35:30,ce47172c-7144-11e5-ba71-058fbc01cf0b,ce405c52-7144-11e5-ba71-058fbc01cf0b,Empathy,Yawn Warm-up

In [19]:
pd.read_sql_query("SELECT COUNT(*) FROM reviews \
                  ;", mydb)

   COUNT(*)
0     30716

In [20]:
pd.read_sql_query("SELECT dog_guid, subcategory_name, test_name \
                  FROM reviews \
                  WHERE YEAR(created_at) = '2014'\
                  LIMIT 10;", mydb)

                               dog_guid subcategory_name            test_name
0  ce3ac77e-7144-11e5-ba71-058fbc01cf0b          Empathy         Yawn Warm-up
1  ce2aedcc-7144-11e5-ba71-058fbc01cf0b          Empathy  Eye Contact Warm-up
2  ce2aedcc-7144-11e5-ba71-058fbc01cf0b          Empathy     Eye Contact Game
3  ce2aedcc-7144-11e5-ba71-058fbc01cf0b    Communication        Treat Warm-up
4  ce405c52-7144-11e5-ba71-058fbc01cf0b          Empathy         Yawn Warm-up
5  ce405c52-7144-11e5-ba71-058fbc01cf0b          Empathy            Yawn Game
6  ce405c52-7144-11e5-ba71-058fbc01cf0b          Empathy     Eye Contact Game
7  ce405e28-7144-11e5-ba71-058fbc01cf0b    Communication        Treat Warm-up
8  ce405e28-7144-11e5-ba71-058fbc01cf0b          Cunning       Turn Your Back
9  ce2609c4-7144-11e5-ba71-058fbc01cf0b    Communication        Treat Warm-up

** Question 7: How would you select all of the User IDs of customers who have female dogs whose breed includes the word "terrier" somewhere in its name (if you don't limit your output, you should have 1771 rows in your output)? **

In [21]:
pd.read_sql_query("SELECT user_guid \
                  FROM dogs \
                  WHERE gender='female' AND breed LIKE ('%terrier%') \
                  ;", mydb)

                                 user_guid
0     ce138722-7144-11e5-ba71-058fbc01cf0b
1     ce13b152-7144-11e5-ba71-058fbc01cf0b
2     ce21d7d2-7144-11e5-ba71-058fbc01cf0b
3     ce2202e8-7144-11e5-ba71-058fbc01cf0b
4     ce2203f6-7144-11e5-ba71-058fbc01cf0b
...                                    ...
1766  ce9aee7e-7144-11e5-ba71-058fbc01cf0b
1767  ce9afcc0-7144-11e5-ba71-058fbc01cf0b
1768  ce9b222c-7144-11e5-ba71-058fbc01cf0b
1769  ce9b26c8-7144-11e5-ba71-058fbc01cf0b
1770  ce9b2c72-7144-11e5-ba71-058fbc01cf0b

[1771 rows x 1 columns]

**Question 8: How would you select the Dog ID, test name, and subcategory associated with each completed test for the first 100 tests entered in October, 2014?**

In [22]:
complete_test_table = pd.read_sql_query("SELECT * FROM complete_tests", mydb)

In [23]:
#complete_test_table.to_csv("completetest.csv", index=False)

In [24]:
pd.read_sql_query("SELECT * \
                  FROM complete_tests\
                  LIMIT 5;", mydb)

,created_at,updated_at,user_guid,dog_guid,test_name,subcategory_name
0,2013-02-05 18:26:54,2013-02-05 18:26:54,None,fd27b86c-7144-11e5-ba71-058fbc01cf0b,Yawn Warm-up,Empathy
1,2013-02-05 18:31:03,2013-02-05 18:31:03,None,fd27b86c-7144-11e5-ba71-058fbc01cf0b,Yawn Game,Empathy
2,2013-02-05 18:32:04,2013-02-05 18:32:04,None,fd27b86c-7144-11e5-ba71-058fbc01cf0b,Eye Contact Warm-up,Empathy
3,2013-02-05 18:32:25,2013-02-05 18:32:25,None,fd27b86c-7144-11e5-ba71-058fbc01cf0b,Eye Contact Game,Empathy
4,2013-02-05 18:32:56,2013-02-05 18:32:56,None,fd27b86c-7144-11e5-ba71-058fbc01cf0b,Treat Warm-up,Communication

In [25]:
pd.read_sql_query("SELECT dog_guid, test_name, subcategory_name \
                  FROM complete_tests \
                  WHERE YEAR(created_at)='2014' and MONTH(created_at) = '10'  \
                  LIMIT 100;", mydb)

,dog_guid,test_name,subcategory_name
0,fd6a3480-7144-11e5-ba71-058fbc01cf0b,Delayed Cup Game,Memory
1,fd6a3480-7144-11e5-ba71-058fbc01cf0b,Inferential Reasoning Warm-up,Reasoning
2,fd6a3480-7144-11e5-ba71-058fbc01cf0b,Inferential Reasoning Game,Reasoning
3,fd6a3480-7144-11e5-ba71-058fbc01cf0b,Physical Reasoning Warm-up,Reasoning
4,fd6a3480-7144-11e5-ba71-058fbc01cf0b,Physical Reasoning Game,Reasoning
...,...,...,...
95,fd69a7fe-7144-11e5-ba71-058fbc01cf0b,Impossible Task Game,Impossible Task
96,fd69aaa6-7144-11e5-ba71-058fbc01cf0b,Yawn Warm-up,Empathy
97,fd69f524-7144-11e5-ba71-058fbc01cf0b,Impossible Task Warm-up,Impossible Task
98,fd69f524-7144-11e5-ba71-058fbc01cf0b,Impossible Task Game,Impossible Task
99,fd69f420-7144-11e5-ba71-058fbc01cf0b,Impossible Task Warm-up,Impossible Task

There are many more operators you can use in your WHERE clauses to restrict the data you select as well.  We do not have the space to go over each one individually in this lesson, but I encourage you to explore them on your own.  <mark>*This is a great area to practice being fearless and bold in your desire to learn new things!  The more you try, the more you will learn.*</mark>  

**Feel free to practice any other functions or operators you discover in the space below:**